# Working with Python Pandas

In [1]:
import pandas as pd

### Creating a DataFrame

In [5]:
data = {'name of the student': ['Alice', 'Sophie', 'Elsa'],
        'age': [17, 19, 21],
        'height': [1.82, 1.80, 1.75],
        'country': ['USA', 'FR', 'IT'] }

df = pd.DataFrame(data)

### Printing the DataFrame

In [6]:
df

  name of the student  age  height country
0               Alice   17    1.82     USA
1              Sophie   19    1.80      FR
2                Elsa   21    1.75      IT

A column in a DataFrame can be retrieved as a Series either by its **column's name** or by its **attribute**. The former works for any column name, whereas the later only works when the column name is a valid Python identifier.

In [7]:
df['name of the student']

0     Alice
1    Sophie
2      Elsa
Name: name of the student, dtype: object

In [14]:
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
name of the student    3 non-null object
age                    3 non-null int64
height                 3 non-null float64
country                3 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes

Rows can also be retrieved by position or name with the special `loc` attribute

In [8]:
df.loc[1]

name of the student    Sophie
age                        19
height                    1.8
country                    FR
Name: 1, dtype: object

### Inspecting the data

# Reading data from a CSV file

In [15]:
df.notnull()

   name of the student   age  height  country
0                 True  True    True     True
1                 True  True    True     True
2                 True  True    True     True

In [16]:
carsales = pd.read_csv('data/carsales.csv')

In [18]:
carsales.describe()

              Year       Month         Sales
count   108.000000  108.000000    108.000000
mean   1964.000000    6.500000  14595.111111
std       2.594026    3.468146   4525.213913
min    1960.000000    1.000000   5568.000000
25%    1962.000000    3.750000  11391.250000
50%    1964.000000    6.500000  14076.000000
75%    1966.000000    9.250000  17595.750000
max    1968.000000   12.000000  26099.000000